handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_can.c
/**
*     Copyright (c) 2023, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g05x_can.c
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2023, Nations Technologies Inc. All rights reserved.
**/

#include "n32g05x_can.h"
#include "n32g05x_rcc.h"

/** CAN Private Defines **/

static INTStatus CheckINTStatus(uint32_t CAN_Reg, uint32_t Int_Bit);

/** CAN Driving Functions Declaration **/

/**
*\*\name    CAN_DeInit
*\*\fun     Deinitializes the CAN peripheral registers to their default reset values.
*\*\param   CANx:
*\*\             - CAN
*\*\return  none
**/
void CAN_DeInit(CAN_Module* CANx)
{
    RCC_EnableAPB1PeriphReset(RCC_APB1_PERIPH_CAN);
}


/**
*\*\name   CAN_Init
*\*\fun    Initializes the CAN peripheral according to the specified
*\*\       parameters in the CAN_initializes_parameter.
*\*\param  CANx:
*\*\            - CAN
*\*\param  CAN_InitParam (The input parameters must be the following values) :
*\*\            - BaudRatePrescaler
*\*\                - It ranges from 1 to 1024.
*\*\            - OperatingMode
*\*\                - CAN_Normal_Mode
*\*\                - CAN_LoopBack_Mode
*\*\                - CAN_Silent_Mode
*\*\                - CAN_Silent_LoopBack_Mode
*\*\            - RSJW
*\*\                - CAN_RSJW_1tq
*\*\                - CAN_RSJW_2tq
*\*\                - CAN_RSJW_3tq
*\*\                - CAN_RSJW_4tq
*\*\            - TBS1
*\*\                - CAN_TBS1_1tq
*\*\                - CAN_TBS1_2tq
*\*\                - CAN_TBS1_3tq
*\*\                - CAN_TBS1_4tq
*\*\                - CAN_TBS1_5tq
*\*\                - CAN_TBS1_6tq
*\*\                - CAN_TBS1_7tq
*\*\                - CAN_TBS1_8tq
*\*\                - CAN_TBS1_9tq
*\*\                - CAN_TBS1_10tq
*\*\                - CAN_TBS1_11tq
*\*\                - CAN_TBS1_12tq
*\*\                - CAN_TBS1_13tq
*\*\                - CAN_TBS1_14tq
*\*\                - CAN_TBS1_15tq
*\*\                - CAN_TBS1_16tq
*\*\            - TBS2
*\*\                - CAN_TBS2_1tq
*\*\                - CAN_TBS2_2tq
*\*\                - CAN_TBS2_3tq
*\*\                - CAN_TBS2_4tq
*\*\                - CAN_TBS2_5tq
*\*\                - CAN_TBS2_6tq
*\*\                - CAN_TBS2_7tq
*\*\                - CAN_TBS2_8tq
*\*\            - TTCM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - ABOM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - AWKUM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - NART
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - RFLM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - TXFP
*\*\                - DISABLE
*\*\                - ENABLE           
*\*\return InitStatus :
*\*\            - CAN_InitSTS_Failed
*\*\            - CAN_InitSTS_Success
**/
uint8_t CAN_Init(CAN_Module* CANx, CAN_InitType* CAN_InitParam)
{
    uint8_t InitStatus;
    uint32_t wait_ack  = 0x00000000;

    /* Exit from sleep mode */
    CANx->MCTRL &= (~(uint32_t)CAN_MCTRL_SLPRQ);

    /* Request initialisation */
    CANx->MCTRL |= CAN_MCTRL_INIRQ;

    /* Wait the acknowledge */
    while (((CANx->MSTS & CAN_MSTS_INIAK) != CAN_MSTS_INIAK) && (wait_ack != INIAK_TIMEOUT))
    {
        wait_ack++;
    }

    /* Check acknowledge */
    if ((CANx->MSTS & CAN_MSTS_INIAK) != CAN_MSTS_INIAK)
    {
        InitStatus = CAN_InitSTS_Failed;
    }
    else
    {
        /* Set the time triggered communication mode */
        if (CAN_InitParam->TTCM == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_TTCM;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_TTCM;
        }

        /* Set the automatic bus-off management */
        if (CAN_InitParam->ABOM == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_ABOM;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_ABOM;
        }

