handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_can.c
        /* Set the automatic wake-up mode */
        if (CAN_InitParam->AWKUM == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_AWKUM;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_AWKUM;
        }

        /* Set the no automatic retransmission */
        if (CAN_InitParam->NART == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_NART;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_NART;
        }

        /* Set the receive DATFIFO locked mode */
        if (CAN_InitParam->RFLM == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_RFLM;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_RFLM;
        }

        /* Set the transmit DATFIFO priority */
        if (CAN_InitParam->TXFP == ENABLE)
        {
            CANx->MCTRL |= CAN_MCTRL_TXFP;
        }
        else
        {
            CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_TXFP;
        }

        /* Set the bit timing register */
        CANx->BTIM = (uint32_t)((uint32_t)CAN_InitParam->OperatingMode << 30) | ((uint32_t)CAN_InitParam->RSJW << 24)
                    | ((uint32_t)CAN_InitParam->TBS1 << 16) | ((uint32_t)CAN_InitParam->TBS2 << 20)
                    | ((uint32_t)CAN_InitParam->BaudRatePrescaler - (uint32_t)0x1);

        /* Request leave initialisation */
        CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_INIRQ;

        /* Wait the acknowledge */
        wait_ack = 0;

        while (((CANx->MSTS & CAN_MSTS_INIAK) == CAN_MSTS_INIAK) && (wait_ack != INIAK_TIMEOUT))
        {
            wait_ack++;
        }

        /* ...and check acknowledged */
        if ((CANx->MSTS & CAN_MSTS_INIAK) == CAN_MSTS_INIAK)
        {
            InitStatus = CAN_InitSTS_Failed;
        }
        else
        {
            InitStatus = CAN_InitSTS_Success;
        }
    }

    /* At this step, return the status of initialization */
    return InitStatus;
}


/**
*\*\name   CAN_InitFilter
*\*\fun    Initializes the CAN peripheral according to the specified
*\*\       parameters in the CAN_filter_initializes_structure.
*\*\param  CAN_InitFilterStruct (The input parameters must be the following values) :
*\*\            - Filter_HighId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - Filter_LowId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - FilterMask_HighId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - FilterMask_LowId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - Filter_FIFOAssignment
*\*\                - CAN_Filter_FIFO0
*\*\                - CAN_Filter_FIFO1
*\*\            - Filter_Num
*\*\                - It ranges from 0 to 13
*\*\            - Filter_Mode
*\*\                - CAN_Filter_IdMaskMode
*\*\                - CAN_Filter_IdListMode
*\*\            - Filter_Scale
*\*\                - CAN_Filter_16bitScale
*\*\                - CAN_Filter_32bitScale
*\*\            - Filter_Act
*\*\                - ENABLE
*\*\                - DISABLE
*\*\return none
**/
void CAN_InitFilter(CAN_FilterInitType* CAN_InitFilterStruct)
{
    uint32_t filter_number_bit_pos;

    filter_number_bit_pos = ((uint32_t)1) << CAN_InitFilterStruct->Filter_Num;

    /* Initialisation mode for the filter */
    CAN->FMC |= FMC_FINITM;

    /* Filter Deactivation */
    CAN->FA1 &= ~(uint32_t)filter_number_bit_pos;

    /* Filter Scale */
    if (CAN_InitFilterStruct->Filter_Scale == CAN_Filter_16bitScale)
    {
        /* 16-bit scale for the filter */
        CAN->FS1 &= ~(uint32_t)filter_number_bit_pos;

        /* First 16-bit identifier and First 16-bit mask */
        /* Or First 16-bit identifier and Second 16-bit identifier */
        CAN->sFilterRegister[CAN_InitFilterStruct->Filter_Num].FR1 =
            (((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->FilterMask_LowId) << 16)
            | ((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->Filter_LowId);

        /* Second 16-bit identifier and Second 16-bit mask */
        /* Or Third 16-bit identifier and Fourth 16-bit identifier */
        CAN->sFilterRegister[CAN_InitFilterStruct->Filter_Num].FR2 =
            (((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->FilterMask_HighId) << 16)
            | ((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->Filter_HighId);
    }

    if (CAN_InitFilterStruct->Filter_Scale == CAN_Filter_32bitScale)
    {
        /* 32-bit scale for the filter */
        CAN->FS1 |= filter_number_bit_pos;
        /* 32-bit identifier or First 32-bit identifier */
        CAN->sFilterRegister[CAN_InitFilterStruct->Filter_Num].FR1 =
            (((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->Filter_HighId) << 16)
            | ((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->Filter_LowId);
        /* 32-bit mask or Second 32-bit identifier */
        CAN->sFilterRegister[CAN_InitFilterStruct->Filter_Num].FR2 =
            (((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->FilterMask_HighId) << 16)
            | ((uint32_t)0x0000FFFF & (uint32_t)CAN_InitFilterStruct->FilterMask_LowId);
    }

    /* Filter Mode */
    if (CAN_InitFilterStruct->Filter_Mode == CAN_Filter_IdMaskMode)
    {
        /*Id/Mask mode for the filter*/
        CAN->FM1 &= ~(uint32_t)filter_number_bit_pos;
    }
    else /* CAN_InitFilterStruct->Filter_Mode == CAN_Filter_IdListMode */
    {
        /*Identifier list mode for the filter*/
        CAN->FM1 |= (uint32_t)filter_number_bit_pos;
    }

    /* Filter DATFIFO assignment */
    if (CAN_InitFilterStruct->Filter_FIFOAssignment == CAN_Filter_FIFO0)
    {
        /* DATFIFO 0 assignation for the filter */
        CAN->FFA1 &= ~(uint32_t)filter_number_bit_pos;
    }

    if (CAN_InitFilterStruct->Filter_FIFOAssignment == CAN_Filter_FIFO1)
    {
        /* DATFIFO 1 assignation for the filter */
        CAN->FFA1 |= (uint32_t)filter_number_bit_pos;
    }

    /* Filter activation */
    if (CAN_InitFilterStruct->Filter_Act == ENABLE)
    {
        CAN->FA1 |= filter_number_bit_pos;
    }

    /* Leave the initialisation mode for the filter */
    CAN->FMC &= ~FMC_FINITM;
}

/**
*\*\name   CAN_InitStruct
*\*\fun    Fills each CAN_initializes_parameter member with its default value.
*\*\param  CAN_InitParam (The input parameters must be the following values) :
*\*\            - BaudRatePrescaler
*\*\                - It ranges from 1 to 1024.
*\*\            - OperatingMode
*\*\                - CAN_Normal_Mode
*\*\                - CAN_LoopBack_Mode
*\*\                - CAN_Silent_Mode
*\*\                - CAN_Silent_LoopBack_Mode
*\*\            - RSJW
*\*\                - CAN_RSJW_1tq
*\*\                - CAN_RSJW_2tq
*\*\                - CAN_RSJW_3tq
*\*\                - CAN_RSJW_4tq
*\*\            - TBS1
*\*\                - CAN_TBS1_1tq
*\*\                - CAN_TBS1_2tq
*\*\                - CAN_TBS1_3tq
*\*\                - CAN_TBS1_4tq
*\*\                - CAN_TBS1_5tq
*\*\                - CAN_TBS1_6tq
*\*\                - CAN_TBS1_7tq
*\*\                - CAN_TBS1_8tq
*\*\                - CAN_TBS1_9tq
*\*\                - CAN_TBS1_10tq
*\*\                - CAN_TBS1_11tq
*\*\                - CAN_TBS1_12tq
*\*\                - CAN_TBS1_13tq
*\*\                - CAN_TBS1_14tq
*\*\                - CAN_TBS1_15tq
*\*\                - CAN_TBS1_16tq
*\*\            - TBS2
*\*\                - CAN_TBS2_1tq
*\*\                - CAN_TBS2_2tq
*\*\                - CAN_TBS2_3tq
*\*\                - CAN_TBS2_4tq
*\*\                - CAN_TBS2_5tq
*\*\                - CAN_TBS2_6tq
*\*\                - CAN_TBS2_7tq
*\*\                - CAN_TBS2_8tq
*\*\            - TTCM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - ABOM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - AWKUM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - NART
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - RFLM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - TXFP
*\*\                - DISABLE
*\*\                - ENABLE 
*\*\return none
**/
void CAN_InitStruct(CAN_InitType* CAN_InitParam)
{
    /* Reset CAN init structure parameters values */

    /* Initialize the time triggered communication mode */
    CAN_InitParam->TTCM = DISABLE;

