handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_can.c
    /* Initialize the automatic bus-off management */
    CAN_InitParam->ABOM = DISABLE;

    /* Initialize the automatic wake-up mode */
    CAN_InitParam->AWKUM = DISABLE;

    /* Initialize the no automatic retransmission */
    CAN_InitParam->NART = DISABLE;

    /* Initialize the receive DATFIFO locked mode */
    CAN_InitParam->RFLM = DISABLE;

    /* Initialize the transmit DATFIFO priority */
    CAN_InitParam->TXFP = DISABLE;

    /* Initialize the OperatingMode member */
    CAN_InitParam->OperatingMode = CAN_Normal_Mode;

    /* Initialize the RSJW member */
    CAN_InitParam->RSJW = CAN_RSJW_1tq;

    /* Initialize the TBS1 member */
    CAN_InitParam->TBS1 = CAN_TBS1_4tq;

    /* Initialize the TBS2 member */
    CAN_InitParam->TBS2 = CAN_TBS2_3tq;

    /* Initialize the BaudRatePrescaler member */
    CAN_InitParam->BaudRatePrescaler = 1;
}

/**
*\*\name   CAN_DebugFreeze
*\*\fun    Enables the DBG Freeze for CAN.
*\*\param  CANx:
*\*\            - CAN
*\*\param  Cmd (The input parameters must be the following values):
*\*\            - DISABLE
*\*\            - ENABLE
*\*\return none
**/
void CAN_DebugFreeze(CAN_Module* CANx, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable Debug Freeze  */
        CANx->MCTRL |= MCTRL_DBGF;
    }
    else
    {
        /* Disable Debug Freeze */
        CANx->MCTRL &= ~MCTRL_DBGF;
    }
}

/**
*\*\name   CAN_EnTTComMode
*\*\fun    Enables the CAN Time stamp sent.
*\*\param  CANx:
*\*\            - CAN
*\*\param  Cmd (The input parameters must be the following values):
*\*\            - DISABLE
*\*\            - ENABLE
*\*\note   when enabled, Time stamp (TIME[15:0]) value is sent in the last
*\*\       two data bytes of the 8-byte message: TIME[7:0] in data byte 6
*\*\       and TIME[15:8] in data byte 7
*\*\note   DLC must be programmed as 8 in order Time Stamp (2 bytes) to be
*\*\       sent over the CAN bus.
*\*\return none
**/
void CAN_EnTTComMode(CAN_Module* CANx, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the TTCM mode */
        CANx->MCTRL |= CAN_MCTRL_TTCM;

        /* Set TGT bits */
        CANx->sTxMailBox[0].TMDT |= ((uint32_t)CAN_TMDT0_TGT);
        CANx->sTxMailBox[1].TMDT |= ((uint32_t)CAN_TMDT1_TGT);
        CANx->sTxMailBox[2].TMDT |= ((uint32_t)CAN_TMDT2_TGT);
    }
    else
    {
        /* Disable the TTCM mode */
        CANx->MCTRL &= (uint32_t)(~(uint32_t)CAN_MCTRL_TTCM);

        /* Reset TGT bits */
        CANx->sTxMailBox[0].TMDT &= ((uint32_t)~CAN_TMDT0_TGT);
        CANx->sTxMailBox[1].TMDT &= ((uint32_t)~CAN_TMDT1_TGT);
        CANx->sTxMailBox[2].TMDT &= ((uint32_t)~CAN_TMDT2_TGT);
    }
}


/**
*\*\name   CAN_TransmitMessage
*\*\fun    initialize the transmission of a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  TxMessage  (The input parameters must be the following values):
*\*\            - StdId
*\*\                - It ranges from 0 to 0x7FF
*\*\            - ExtId
*\*\                - It ranges from 0 to 0x1FFFFFFF
*\*\            - IDE
*\*\                - CAN_Standard_Id
*\*\                - CAN_Extended_Id
*\*\            - RTR
*\*\                - CAN_RTRQ_Data
*\*\                - CAN_RTRQ_Remote
*\*\            - DLC
*\*\                - It ranges from 0 to 8
*\*\            - Data[0-7]
*\*\                - It ranges from 0 to 0xFF
*\*\return  transmit_mailbox (The input parameters must be the following values) :
*\*\            - CAN_TXMAILBOX_0
*\*\            - CAN_TXMAILBOX_1
*\*\            - CAN_TXMAILBOX_2
*\*\            - CAN_TxSTS_NoMailBox
**/
uint8_t CAN_TransmitMessage(CAN_Module* CANx, CanTxMessage* TxMessage)
{
    uint8_t transmit_mailbox;

    /* Select one empty transmit mailbox */
    if ((CANx->TSTS & CAN_TSTS_TMEM0) == CAN_TSTS_TMEM0)
    {
        transmit_mailbox = 0;
    }
    else if ((CANx->TSTS & CAN_TSTS_TMEM1) == CAN_TSTS_TMEM1)
    {
        transmit_mailbox = 1;
    }
    else if ((CANx->TSTS & CAN_TSTS_TMEM2) == CAN_TSTS_TMEM2)
    {
        transmit_mailbox = 2;
    }
    else
    {
        transmit_mailbox = CAN_TxSTS_NoMailBox;
    }

    if (transmit_mailbox != CAN_TxSTS_NoMailBox)
    {
        /* Set up the Id */
        CANx->sTxMailBox[transmit_mailbox].TMI &= TMIDxR_TXRQ;
        if (TxMessage->IDE == CAN_Standard_Id)
        {
            CANx->sTxMailBox[transmit_mailbox].TMI |= ((TxMessage->StdId << 21) | TxMessage->RTR);
        }
        else
        {
            CANx->sTxMailBox[transmit_mailbox].TMI |= ((TxMessage->ExtId << 3) | TxMessage->IDE | TxMessage->RTR);
        }

        /* Set up the DLC */
        TxMessage->DLC &= (uint8_t)0x0000000F;
        CANx->sTxMailBox[transmit_mailbox].TMDT &= (uint32_t)0xFFFFFFF0U;
        CANx->sTxMailBox[transmit_mailbox].TMDT |= TxMessage->DLC;

        /* Set up the data field */
        CANx->sTxMailBox[transmit_mailbox].TMDL =
            (((uint32_t)TxMessage->Data[3] << 24) | ((uint32_t)TxMessage->Data[2] << 16)
             | ((uint32_t)TxMessage->Data[1] << 8) | ((uint32_t)TxMessage->Data[0]));
        CANx->sTxMailBox[transmit_mailbox].TMDH =
            (((uint32_t)TxMessage->Data[7] << 24) | ((uint32_t)TxMessage->Data[6] << 16)
             | ((uint32_t)TxMessage->Data[5] << 8) | ((uint32_t)TxMessage->Data[4]));
        /* Request transmission */
        CANx->sTxMailBox[transmit_mailbox].TMI |= TMIDxR_TXRQ;
    }
    return transmit_mailbox;
}

/**
*\*\name   CAN_TransmitSTS
*\*\fun    Checks the transmission of a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  mailbox_queue (The input parameters must be the following values) :
*\*\            - CAN_TXMAILBOX_0
*\*\            - CAN_TXMAILBOX_1
*\*\            - CAN_TXMAILBOX_2
*\*\return state :
*\*\            - CAN_TxSTS_Failed
*\*\            - CAN_TxSTS_Ok
*\*\            - CAN_TxSTS_Pending
**/
uint8_t CAN_TransmitSTS(const CAN_Module* CANx, uint8_t TransmitMailbox)
{
    uint32_t state;

    switch (TransmitMailbox)
    {
    case (CAN_TXMAILBOX_0):
        state = CANx->TSTS & (CAN_TSTS_RQCPM0 | CAN_TSTS_TXOKM0 | CAN_TSTS_TMEM0);
        break;
    case (CAN_TXMAILBOX_1):
        state = CANx->TSTS & (CAN_TSTS_RQCPM1 | CAN_TSTS_TXOKM1 | CAN_TSTS_TMEM1);
        break;
    case (CAN_TXMAILBOX_2):
        state = CANx->TSTS & (CAN_TSTS_RQCPM2 | CAN_TSTS_TXOKM2 | CAN_TSTS_TMEM2);
        break;
    default:
        state = (uint32_t)CAN_TxSTS_Failed;
        break;
    }
    switch (state)
    {
        /* transmit pending  */
    case (0x0):
        state = (uint32_t)CAN_TxSTS_Pending;
        break;
        /* transmit failed  */
    case (CAN_TSTS_RQCPM0 | CAN_TSTS_TMEM0):
        state = (uint32_t)CAN_TxSTS_Failed;
        break;
    case (CAN_TSTS_RQCPM1 | CAN_TSTS_TMEM1):
        state = (uint32_t)CAN_TxSTS_Failed;
        break;
    case (CAN_TSTS_RQCPM2 | CAN_TSTS_TMEM2):
        state = (uint32_t)CAN_TxSTS_Failed;
        break;
        /* transmit succeeded  */
    case (CAN_TSTS_RQCPM0 | CAN_TSTS_TXOKM0 | CAN_TSTS_TMEM0):
        state = (uint32_t)CAN_TxSTS_Ok;
        break;
    case (CAN_TSTS_RQCPM1 | CAN_TSTS_TXOKM1 | CAN_TSTS_TMEM1):
        state = (uint32_t)CAN_TxSTS_Ok;
        break;
    case (CAN_TSTS_RQCPM2 | CAN_TSTS_TXOKM2 | CAN_TSTS_TMEM2):
        state = (uint32_t)CAN_TxSTS_Ok;
        break;
    default:
        state = (uint32_t)CAN_TxSTS_Failed;
        break;
    }
    return (uint8_t)state;
}


/**
*\*\name   CAN_CancelTransmitMessage
*\*\brief  Cancels a transmit request.
*\*\param  CANx:
*\*\            - CAN
*\*\param  Mailbox (The input parameters must be the following values) :
*\*\            - CAN_TXMAILBOX_0
*\*\            - CAN_TXMAILBOX_1
*\*\            - CAN_TXMAILBOX_2
*\*\return none
**/
void CAN_CancelTransmitMessage(CAN_Module* CANx, uint8_t Mailbox)
{
    /* abort transmission */
    switch (Mailbox)
    {
    case (CAN_TXMAILBOX_0):
        CANx->TSTS |= CAN_TSTS_ABRQM0;
        break;
    case (CAN_TXMAILBOX_1):
        CANx->TSTS |= CAN_TSTS_ABRQM1;
        break;
    case (CAN_TXMAILBOX_2):
        CANx->TSTS |= CAN_TSTS_ABRQM2;
        break;
    default:
        break;
    }
}

/**
*\*\name   CAN_ReceiveMessage
*\*\fun    Receives a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  FIFONum (The input parameters must be the following values) :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\param  RxMessage (The input parameters must be the following values) :
*\*\            - StdId
*\*\                - It ranges from 0 to 0x7FF
*\*\            - ExtId
*\*\                - It ranges from 0 to 0x1FFFFFFF
*\*\            - IDE
*\*\                - CAN_Standard_Id
*\*\                - CAN_Extended_Id
*\*\            - RTR
*\*\                - CAN_RTRQ_Data
*\*\                - CAN_RTRQ_Remote
*\*\            - DLC
*\*\                - It ranges from 0 to 8
*\*\            - Data[0-7]
*\*\                - It ranges from 0 to 0xFF
*\*\            - FMI
*\*\                - It ranges from 0 to 0xFF
*\*\return none
**/
void CAN_ReceiveMessage(CAN_Module* CANx, uint8_t FIFONum, CanRxMessage* RxMessage)
{
    /* Get the Id */
    RxMessage->IDE = (uint8_t)(CAN_RMIx_IDE & CANx->sFIFOMailBox[FIFONum].RMI);
    if (RxMessage->IDE == CAN_Standard_Id)
    {
        RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONum].RMI >> 21);
    }
    else
    {
        RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONum].RMI >> 3);
    }

    RxMessage->RTR = (uint8_t)(CAN_RMIx_RTRQ & CANx->sFIFOMailBox[FIFONum].RMI);
    /* Get the DLC */
    RxMessage->DLC = (uint8_t)(CAN_TMDTx_DLC & CANx->sFIFOMailBox[FIFONum].RMDT);
    /* Get the FMI */
    RxMessage->FMI = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDT >> 8));
    /* Get the data field */
    RxMessage->Data[0] = (uint8_t)(CAN_DATA_FIFO_MASK & CANx->sFIFOMailBox[FIFONum].RMDL);
    RxMessage->Data[1] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDL >> 8));
    RxMessage->Data[2] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDL >> 16));
    RxMessage->Data[3] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDL >> 24));
    RxMessage->Data[4] = (uint8_t)(CAN_DATA_FIFO_MASK & CANx->sFIFOMailBox[FIFONum].RMDH);
    RxMessage->Data[5] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDH >> 8));
    RxMessage->Data[6] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDH >> 16));
    RxMessage->Data[7] = (uint8_t)(CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFONum].RMDH >> 24));
    /* Release the DATFIFO */
    /* Release FIFO0 */
    if (FIFONum == CAN_FIFO0)
    {
        CANx->RFF0 |= CAN_RFF0_RFFOM0;
    }
    /* Release FIFO1 */
    else /* FIFONum == CAN_FIFO1 */
    {
        CANx->RFF1 |= CAN_RFF1_RFFOM1;
    }
}

/**
*\*\name   CAN_ReleaseFIFO
*\*\fun    Releases the specified DATAFIFO.
*\*\param  CANx:
*\*\            - CAN
*\*\param  FIFONum (The input parameters must be the following values) :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\return none
**/
void CAN_ReleaseFIFO(CAN_Module* CANx, uint8_t FIFONum)
{
    /* Release FIFO0 */
    if (FIFONum == CAN_FIFO0)
    {
        CANx->RFF0 |= CAN_RFF0_RFFOM0;
    }
    /* Release FIFO1 */
    else /* FIFONum == CAN_FIFO1 */
    {
        CANx->RFF1 |= CAN_RFF1_RFFOM1;
    }
}

/**
*\*\name   CAN_PendingMessage
*\*\fun    Returns the number of pending messages.
*\*\param  CANx :
*\*\            - CAN
*\*\param  FIFONum (The input parameters must be the following values) :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\return message_pending : 
*\*\            - CAN_FIFOX_PENDING_0
*\*\            - CAN_FIFOX_PENDING_1
*\*\            - CAN_FIFOX_PENDING_2
*\*\            - CAN_FIFOX_PENDING_3
**/
uint8_t CAN_PendingMessage(const CAN_Module* CANx, uint8_t FIFONum)
{
    uint8_t message_pending;

    if (FIFONum == CAN_FIFO0)
    {
        message_pending = (uint8_t)(CANx->RFF0 & (uint32_t)0x03);
    }
    else if (FIFONum == CAN_FIFO1)
    {
        message_pending = (uint8_t)(CANx->RFF1 & (uint32_t)0x03);
    }
    else
    {
        message_pending = 0;
    }
    return message_pending;
}

/**
*\*\name   CAN_OperatingModeReq
*\*\fun    Select the CAN Operation mode.
*\*\param  CANx:
*\*\            - CAN
*\*\param  CAN_OperatingMode (The input parameters must be the following values) :
*\*\               - CAN_Operating_InitMode
*\*\               - CAN_Operating_NormalMode
*\*\               - CAN_Operating_SleepMode
*\*\return status :
*\*\               - CAN_ModeSTS_Failed    CAN failed entering the specific mode
*\*\               - CAN_ModeSTS_Success   CAN Succeed entering the specific mode
**/
uint8_t CAN_OperatingModeReq(CAN_Module* CANx, uint8_t CAN_OperatingMode)
{
    uint8_t status;

    /* Timeout for INAK or also for SLAK bits*/
    uint32_t timeout = INIAK_TIMEOUT;

