handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_can.c
    if (CAN_OperatingMode == CAN_Operating_InitMode)
    {
        /* Request initialisation */
        CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_MCTRL_SLPRQ)) | CAN_MCTRL_INIRQ);

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != CAN_MSTS_INIAK) && (timeout != (uint32_t)0))
        {
            timeout--;
        }
        if ((CANx->MSTS & CAN_MODE_MASK) != CAN_MSTS_INIAK)
        {
            status = CAN_ModeSTS_Failed;
        }
        else
        {
            status = CAN_ModeSTS_Success;
        }
    }
    else if (CAN_OperatingMode == CAN_Operating_NormalMode)
    {
        /* Request leave initialisation and sleep mode  and enter Normal mode */
        CANx->MCTRL &= (uint32_t)(~(CAN_MCTRL_SLPRQ | CAN_MCTRL_INIRQ));

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != (uint32_t)0) && (timeout != (uint32_t)0))
        {
            timeout--;
        }
        if ((CANx->MSTS & CAN_MODE_MASK) != (uint32_t)0)
        {
            status = CAN_ModeSTS_Failed;
        }
        else
        {
            status = CAN_ModeSTS_Success;
        }
    }
    else if (CAN_OperatingMode == CAN_Operating_SleepMode)
    {
        /* Request Sleep mode */
        CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_MCTRL_INIRQ)) | CAN_MCTRL_SLPRQ);

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != CAN_MSTS_SLPAK) && (timeout != (uint32_t)0))
        {
            timeout--;
        }
        if ((CANx->MSTS & CAN_MODE_MASK) != CAN_MSTS_SLPAK)
        {
            status = CAN_ModeSTS_Failed;
        }
        else
        {
            status = CAN_ModeSTS_Success;
        }
    }
    else
    {
        status = CAN_ModeSTS_Failed;
    }

    return (uint8_t)status;
}

/**
*\*\name   CAN_EnterSleep
*\*\fun    Enters sleep mode.
*\*\param  CANx:
*\*\            - CAN
*\*\return sleepstatus: 
*\*\            - CAN_SLEEP_Ok
*\*\            - CAN_SLEEP_Failed
**/
uint8_t CAN_EnterSleep(CAN_Module* CANx)
{
    uint8_t sleepstatus = CAN_SLEEP_Failed;

    /* Request Sleep mode */
    CANx->MCTRL = (((CANx->MCTRL) & (uint32_t)(~(uint32_t)CAN_MCTRL_INIRQ)) | CAN_MCTRL_SLPRQ);

    /* Sleep mode status */
    if ((CANx->MSTS & (CAN_MSTS_SLPAK | CAN_MSTS_INIAK)) == CAN_MSTS_SLPAK)
    {
        /* Sleep mode entered */
        sleepstatus = CAN_SLEEP_Ok;
    }
    /* return sleep mode status */
    return (uint8_t)sleepstatus;
}

/**
*\*\name   CAN_WakeUp
*\*\fun    Wakes the CAN up.
*\*\param  CANx:
*\*\            - CAN
*\*\return CAN_Status: 
*\*\            - CAN_WKU_Ok
*\*\            - CAN_WKU_Failed
**/
uint8_t CAN_WakeUp(CAN_Module* CANx)
{
    uint32_t wait_slak   = SLPAK_TIMEOUT;
    uint8_t wakeupstatus = CAN_WKU_Failed;

    /* Wake up request */
    CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_SLPRQ;

    /* Sleep mode status */
    while (((CANx->MSTS & CAN_MSTS_SLPAK) == CAN_MSTS_SLPAK) && (wait_slak != (uint32_t)0x00))
    {
        wait_slak--;
    }
    if ((CANx->MSTS & CAN_MSTS_SLPAK) != CAN_MSTS_SLPAK)
    {
        /* wake up done : Sleep mode exited */
        wakeupstatus = CAN_WKU_Ok;
    }
    /* return wakeup status */
    return (uint8_t)wakeupstatus;
}

/**
*\*\name   CAN_GetLastErrCode
*\*\fun    Returns the CANx's last error code (LEC).
*\*\param  CANx:
*\*\            - CAN
*\*\return errorcode :
*\*\            - CAN_ERRORCODE_NoErr            No Error
*\*\            - CAN_ERRORCODE_StuffErr         Stuff Error
*\*\            - CAN_ERRORCODE_FormErr          Form Error
*\*\            - CAN_ERRORCODE_ACKErr           Acknowledgment Error
*\*\            - CAN_ERRORCODE_BitRecessiveErr  Bit Recessive Error
*\*\            - CAN_ERRORCODE_BitDominantErr   Bit Dominant Error
*\*\            - CAN_ERRORCODE_CRCErr           CRC Error
*\*\            - CAN_ERRORCODE_SoftwareSetErr   Software Set Error
**/
uint8_t CAN_GetLastErrCode(const CAN_Module* CANx)
{
    uint8_t errorcode;

    /* Get the error code*/
    errorcode = (((uint8_t)CANx->ESTS) & (uint8_t)CAN_ESTS_LEC);

    /* Return the error code*/
    return errorcode;
}

/**
*\*\name   CAN_GetReceiveErrCounter
*\*\fun    Returns the CANx Receive Error Counter (REC).
*\*\param  CANx:
*\*\            - CAN
*\*\return counter_value:
*\*\            - It ranges from 0 to 127
*\*\note   In case of an error during reception, this counter is incremented
*\*\       by 1 or by 8 depending on the error condition as defined by the CAN
*\*\       standard. After every successful reception, the counter is
*\*\       decremented by 1 or reset to 120 if its value was higher than 128.
*\*\       When the counter value exceeds 127, the CAN controller enters the
*\*\       error passive state.
**/
uint8_t CAN_GetReceiveErrCounter(const CAN_Module* CANx)
{
    uint8_t counter;

    /* Get the Receive Error Counter*/
    counter = (uint8_t)((CANx->ESTS & CAN_ESTS_RXEC) >> 24);

    /* Return the Receive Error Counter*/
    return counter;
}

/**
*\*\name   CAN_GetLSBTransmitErrCounter
*\*\fun    Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
*\*\param  CAN to to select the CAN peripheral.
*\*\return counter_value:
*\*\            - It ranges from 0 to 127
**/
uint8_t CAN_GetLSBTransmitErrCounter(const CAN_Module* CANx)
{
    uint8_t counter;

    /* Get the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
    counter = (uint8_t)((CANx->ESTS & CAN_ESTS_TXEC) >> 16);

    /* Return the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
    return counter;
}

/**
*\*\name   CAN_INTConfig
*\*\fun    Enables the specified CANx interrupts.
*\*\param  CANx:
*\*\               - CAN
*\*\param  CAN_INT (The input parameters must be the following values) :
*\*\               - CAN_INT_TME,
*\*\               - CAN_INT_FMP0,
*\*\               - CAN_INT_FF0,
*\*\               - CAN_INT_FOV0,
*\*\               - CAN_INT_FMP1,
*\*\               - CAN_INT_FF1,
*\*\               - CAN_INT_FOV1,
*\*\               - CAN_INT_EWG,
*\*\               - CAN_INT_EPV,
*\*\               - CAN_INT_BOF,
*\*\               - CAN_INT_LEC,
*\*\               - CAN_INT_ERR,
*\*\               - CAN_INT_WKU,
*\*\               - CAN_INT_SLK.
*\*\param  Cmd :
*\*\               - DISABLE
*\*\               - ENABLE
*\*\return none
**/
void CAN_INTConfig(CAN_Module* CANx, uint32_t CAN_INT, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the selected CANx interrupt */
        CANx->INTE |= CAN_INT;
    }
    else
    {
        /* Disable the selected CANx interrupt */
        CANx->INTE &= ~CAN_INT;
    }
}


/**
*\*\name   CAN_GetFlagSTS
*\*\fun    Checks whether the specified CAN flag is set or not.
*\*\param  CANx:
*\*\                - CAN
*\*\param  CAN_flag (The input parameters must be the following values) :
*\*\                - CAN_FLAG_EWGFL
*\*\                - CAN_FLAG_EPVFL
*\*\                - CAN_FLAG_BOFFL
*\*\                - CAN_FLAG_LEC
*\*\                - CAN_FLAG_RQCPM0
*\*\                - CAN_FLAG_RQCPM1
*\*\                - CAN_FLAG_RQCPM2
*\*\                - CAN_FLAG_FFMP1
*\*\                - CAN_FLAG_FFULL1
*\*\                - CAN_FLAG_FFOVR1
*\*\                - CAN_FLAG_FFMP0
*\*\                - CAN_FLAG_FFULL0
*\*\                - CAN_FLAG_FFOVR0
*\*\                - CAN_FLAG_WKU
*\*\                - CAN_FLAG_SLAK
*\*\return  FlagStatus:
*\*\                - SET
*\*\                - RESET
**/
FlagStatus CAN_GetFlagSTS(const CAN_Module* CANx, uint32_t CAN_FLAG)
{
    FlagStatus bitstatus;

